app/controllers/accounts_controller.rb

	def create
		@account = Account.new(params[:account])
		@type = params[:account][:ty]
		#@profile = current_user.build_profile(params[:profile])
		if @account.save
---
INSERT INTO `accounts` (`authorization`, `created_at`, `email`, `enabled`, `password_digest`, `remember_token`, `ty`, `updated_at`) VALUES ('1', '2013-03-11 22:43:51', 'user@example.com', 1, '$2a$04$hzhuFAMP9KmeY/.4kIc1puXbt8dDT.bGdGrfeu9KoGzaVCCUbNzuS', 'cmzIDkxXvERCKTVVG9KYlA', 'brewery', '2013-03-11 22:43:51')

	def show
		@account= Account.find(params[:id])
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1